# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

print(bin(int(input("Введите число для преобразования в двоичную систему: ")))[2:])